import React, { Component } from 'react'

const TermsPage = () => {

    return (
        <div>
            <h1 className="text-2xl font-bold">תקנון האתר</h1>
            <p>
                <strong>תקנון שימוש באתר</strong><br />
                1. <strong>מבוא</strong><br />
                1.1 אתר event planning (להלן: &quot;האתר&quot;) הינו פלטפורמה מקוונת המאפשרת למשתמשים לשתף אירועים, תמונות, סרטונים והודעות (להלן: &quot;התכנים&quot;).
                1.2 שימוש באתר מהווה הסכמה מלאה לתנאי תקנון זה.<br /><br />

                2. <strong>תנאי שימוש</strong><br />
                2.1 <strong>הרשמה:</strong> על מנת להשתמש באתר, נדרשת הרשמה. המשתמש מתחייב למסור פרטים נכונים ומדויקים בעת ההרשמה.<br />
                2.2 <strong>תכנים:</strong>
                <ul>
                    <li>המשתמש אחראי באופן בלעדי על התכנים שהוא מעלה לאתר.</li>
                    <li>המשתמש מתחייב שלא להעלות תכנים המפרים זכויות יוצרים, סימני מסחר או כל זכות קניין רוחני אחרת.</li>
                    <li>המשתמש מתחייב שלא להעלות תכנים המכילים תוכן פורנוגרפי, גזעני, אלים, מאיים, משמיץ, מפלה או פוגע בפרטיות.</li>
                    <li>המשתמש מתחייב שלא להשתמש בשפה גסה או מעליבה.</li>
                </ul><br />

                2.3 <strong>אחריות:</strong>
                <ul>
                    <li>המשתמש נושא באחריות מלאה לכל נזק שייגרם כתוצאה מהפרת תנאי התקנון.</li>
                    <li>מפעילי האתר אינם אחראים לתכנים המועלים על ידי המשתמשים.</li>
                </ul><br />

                2.4 <strong>פרטיות:</strong> מדיניות הפרטיות של האתר מגדירה את אופן איסוף, שימוש והגנה על המידע האישי של המשתמשים.<br />
                2.5 <strong>שינויים בתקנון:</strong> מפעילי האתר רשאים לשנות את תקנון זה מעת לעת. על המשתמש להתעדכן בתנאי התקנון בכל כניסה לאתר.<br /><br />

                3. <strong>הפרת התקנון</strong><br />
                3.1 במקרה של הפרת תנאי התקנון, מפעילי האתר רשאים לחסום את גישתו של המשתמש לאתר, למחוק את תכניו ולנקוט בכל צעד משפטי אחר.<br /><br />

                4. <strong>שיפוט:</strong> על כל מחלוקת הנובעת מהתקנון או הקשורה אליו יחולו דיני מדינת ישראל ובית המשפט המוסמך בתל אביב-יפו יהיה בעל סמכות שיפוט ייחודית.
            </p>
        </div>
    )
}

export default TermsPage