import React, { Component } from 'react'

const TermsPage = () => {

    return (
        <div>
            <h1 className="text-2xl font-bold">תקנון האתר</h1>
            <p>תקנון שימוש באתר
                1. מבוא
                1.1 אתר event planning (להלן: "האתר") הינו פלטפורמה מקוונת המאפשרת למשתמשים לשתף אירועים, תמונות, סרטונים והודעות (להלן: "התכנים"). 1.2 שימוש באתר מהווה הסכמה מלאה לתנאי תקנון זה.
                2. תנאי שימוש
                2.1 הרשמה: על מנת להשתמש באתר, נדרשת הרשמה. המשתמש מתחייב למסור פרטים נכונים ומדויקים בעת ההרשמה.
                2.2 תכנים: * המשתמש אחראי באופן בלעדי על התכנים שהוא מעלה לאתר. * המשתמש מתחייב שלא להעלות תכנים המפרים זכויות יוצרים, סימני מסחר או כל זכות קניין רוחני אחרת. * המשתמש מתחייב שלא להעלות תכנים המכילים תוכן פורנוגרפי, גזעני, אלים, מאיים, משמיץ, מפלה או פוגע בפרטיות. * המשתמש מתחייב שלא להשתמש בשפה גסה או מעליבה.
                2.3 אחריות: * המשתמש נושא באחריות מלאה לכל נזק שייגרם כתוצאה מהפרת תנאי התקנון. * מפעילי האתר אינם אחראים לתכנים המועלים על ידי המשתמשים. 2.4 פרטיות: מדיניות הפרטיות של האתר מגדירה את אופן איסוף, שימוש והגנה על המידע האישי של המשתמשים. 2.5 שינויים בתקנון: מפעילי האתר רשאים לשנות את תקנון זה מעת לעת. על המשתמש להתעדכן בתנאי התקנון בכל כניסה לאתר.
                3. הפרת התקנון
                3.1 במקרה של הפרת תנאי התקנון, מפעילי האתר רשאים לחסום את גישתו של המשתמש לאתר, למחוק את תכניו ולנקוט בכל צעד משפטי אחר.
                4. שיפוט: על כל מחלוקת הנובעת מהתקנון או הקשורה אליו יחולו דיני מדינת ישראל ובית המשפט המוסמך בתל אביב-יפו יהיה בעל סמכות שיפוט ייחודית.
            </p>
        </div>
    )
}

export default TermsPage